---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCData.op_Equality(Autodesk.Revit.DB.IFC.IFCData,Autodesk.Revit.DB.IFC.IFCData)
source: html/c37ea4b6-ae14-8914-29df-ca9dc136775d.htm
---
# Autodesk.Revit.DB.IFC.IFCData.op_Equality Method

Determines whether two IFCDatas are the same.

## Syntax (C#)
```csharp
public static bool operator ==(
	IFCData first,
	IFCData second
)
```

## Parameters
- **first** (`Autodesk.Revit.DB.IFC.IFCData`) - The first IFCData.
- **second** (`Autodesk.Revit.DB.IFC.IFCData`) - The second IFCData.

## Returns
True if the IFCDatas are the same; otherwise, false.